app/views/posts/_form.html.erb

      <div class="control-group">
      <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>
---
SELECT "categories".* FROM "categories"