app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
                  <span>
          <%= link_to("#{post.comments.size} comments", post_path(post)) %>