app/views/posts/show.html.erb

<!-- us reload to get the lattest from the db -->
<% @post.reload.comments.each do |one_comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]