app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 22 Aug 2014 00:17:54 UTC +00:00], ["name", "Housing"], ["updated_at", Fri, 22 Aug 2014 00:17:54 UTC +00:00]]
---
  def create

    @category = Category.new(category_params)
    if @category.save