app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit(:body))
      # next 2 lines are compressed to the above line
      # @comment = Comments.new(params.require(:comment).permit(:body))
      # @comment.post = @post
    #@comment.user = User.first
    test_id =  rand(0..3).to_i
    if test_id == nil
      test_id =1
    end
    @comment.user = User.find_by id: test_id
    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "I like this too"], ["created_at", Fri, 22 Aug 2014 21:45:35 UTC +00:00], ["post_id", 3], ["updated_at", Fri, 22 Aug 2014 21:45:35 UTC +00:00], ["user_id", 3]]