app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "34"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 02 Sep 2014 18:08:23 UTC +00:00], ["updated_at", Tue, 02 Sep 2014 18:08:23 UTC +00:00], ["user_id", 15], ["vote", true], ["voteable_id", 34], ["voteable_type", "Comment"]]
---
  def vote
    @one_comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: @one_comment, user: current_user, vote: params[:vote])