app/controllers/posts_controller.rb

  def create

    @post = Post.new(post_params)
    test_id =  rand(0..3).to_i
    if test_id == nil
      test_id =1
    end
    @post.user = User.find_by id: test_id
---
SELECT "users".* FROM "users" WHERE ("users"."id" BETWEEN 1 AND 4) LIMIT 1