app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create

    @post = Post.new(post_params)
    #test_id =  rand(0..3).to_i
    #if test_id == nil
    #  test_id =1
    #end
    #@post.user = User.find_by id: test_id
    # above not needed any more
    @post.user = current_user
    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 21 Aug 2014 19:30:31 UTC +00:00], ["description", ""], ["title", "dsfadf"], ["updated_at", Thu, 21 Aug 2014 19:30:31 UTC +00:00], ["url", "dsfds"], ["user_id", 1]]

  def update

    if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["description", "posting this world changing information."], ["updated_at", Thu, 21 Aug 2014 22:59:49 UTC +00:00]]

  def vote
    @vote = Vote.create(voteable: set_post, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 01 Sep 2014 22:53:16 UTC +00:00], ["updated_at", Mon, 01 Sep 2014 22:53:16 UTC +00:00], ["user_id", 15], ["vote", true], ["voteable_id", 39], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 36]]