app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create

    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = 6  [["username", "gsmith5"], ["updated_at", Fri, 29 Aug 2014 21:13:23 UTC +00:00]]
---
  def update


    if @user.update(user_params)